---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSlotNumberByCell(System.Int32,System.Int32)
source: html/2711e7ef-51a8-457a-a22d-02b681454cbd.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSlotNumberByCell Method

Gets the slot number in the circuit table

## Syntax (C#)
```csharp
public int GetSlotNumberByCell(
	int nRow,
	int nCol
)
```

## Parameters
- **nRow** (`System.Int32`) - Column Number
- **nCol** (`System.Int32`)

## Returns
Row Number